[{"id":1,"course_name":"Angular & NodeJS - The MEAN Stack Guide [2023 Edition]","description":"Learn how to create modern, scalable and high-speed web applications with Angular + Node.js + Express + MongoDB . Angular 1 and NodeJS, together with ExpressJS (a NodeJS Framework) and MongoDB formed the very popular MEAN stack. Now is the time to dive into MEAN 2.0 and replace Angular 1 with Angular 2+. Benefit from the many improvements and advantages Angular offers you: Speed, ease of development, highly reactive, awesome support for asynchronous operations, great scalability and more! And combine these advantages with the power of a NodeJS + Express + MongoDB backend!","image":"https://img-b.udemycdn.com/course/480x270/833442_b26e_5.jpg","price":1160.67,"discount":"20%"},
{"id":2,"course_name":"Build Responsive Real-World Websites with HTML and CSS","description":"So, after finishing this course, you will know exactly how to build a beautiful, professional, and ready-to-launch website just like Omnifood, by following a 7-step process. And it will even look great on any computer, tablet, and smartphone.But what if you want to build a completely different website? Well, no problem! I designed the course curriculum with exactly this goal: to enable you to design and build any website that you can think of, not just copy the course project.","image":"https://img-b.udemycdn.com/course/240x135/437398_46c3_10.jpg","price":2890.36,"discount":"15%"},
{"id":3,"course_name":"100 Days of Code: The Complete Python Pro Bootcamp for 2022","description":"Welcome to the 100 Days of Code - The Complete Python Pro Bootcamp, the only course you need to learn to code with Python. With over 500,000 5 STAR reviews and a 4.8 average, my courses are some of the HIGHEST RATED courses in the history of Udemy! . 100 days, 1 hour per day, learn to build 1 project per day, this is how you master Python. At 60+ hours, this Python course is without a doubt the most comprehensive Python course available anywhere online. Even if you have zero programming experience, this course will take you from beginner to professional. ","image":"https://img-b.udemycdn.com/course/240x135/2776760_f176_10.jpg","price":3520.18,"discount":"20%"},
{"id":4,"course_name":"iOS & Swift - The Complete iOS App Development Bootcamp","description":"Welcome to the Complete iOS App Development Bootcamp. With over 39,000 5 star ratings and a 4.8 average my iOS course is the HIGHEST RATED iOS Course in the history of Udemy! At 55+ hours, this iOS 13 course is the most comprehensive iOS development course online! This Swift 5.1 course is based on our in-person app development bootcamp in London, where we've perfected the curriculum over 4 years of in-person teaching.Our complete app development bootcamp teaches you how to code using Swift 5.1 and build beautiful iOS 13 apps for iPhone and iPad. Even if you have ZERO programming experience.I'll take you step-by-step through engaging and fun video tutorials and teach you everything you need to know to succeed as an iOS app developer.The course includes 55+ hours of HD video tutorials and builds your programming knowledge while making real world apps. e.g. Pokemon Go, Whatsapp, QuizUp and Yahoo Weather.","image":"https://img-b.udemycdn.com/course/240x135/1778502_f4b9_12.jpg","price":3780.73,"discount":"25%"},
{"id":5,"course_name":"MongoDB - The Complete Developer's Guide 2023","description":"MongoDB is one of the most important NoSQL databases you can work with these days. It's extremely popular and MongoDB developers are in high demand.No matter if you're building web applications, mobile applications or any other kind of application or if you're a data scientist - you'll need to work with data. Storing data, querying it efficiently and minimizing complexities whilst optimizing performance are crucial tasks.MongoDB makes working with data simple - it's built on a philosophy that prioritizes performance and efficiency.","image":"https://img-b.udemycdn.com/course/240x135/1906852_93c6_2.jpg","price":1280.87,"discount":"20%"},
{"id":6,"course_name":"The Ultimate 2022 Fullstack Web Development Bootcamp","description":"Welcome to the Ultimate 2022 Web Development Bootcamp, the only course you need to learn to code and become a full-stack web developer and the only course that will prepare you for a career in web development.At 40+ hours, this web development course is extremely comprehensive and one of the most detailed courses available on Udemy! Even if you have zero programming experience, this course will take you from beginner to coding ninja","image":"https://img-b.udemycdn.com/course/240x135/3655840_1c3c.jpg","price":2760.53,"discount":"15%"},
{"id":7,"course_name":"GitHub Actions - The Complete Guide","description":"GitHub Actions is an extremely popular and fast-growing CI / CD automation service offered by GitHub.This course teaches GitHub Actions from the ground up, without any prior GitHub Actions experience assumed or required.In order to handle growing development and code complexity and deploy application updates with high frequency, powerful automation platforms and tools are required. As you will learn throughout this course, GitHub Actions is such a platform, enabling you to automate anything from code testing, building and deployment all the way up to GitHub repository and project management.","image":"https://img-b.udemycdn.com/course/240x135/4900166_73e5.jpg","price":1940.75,"discount":"20%"},
{"id":8,"course_name":"Learn TypeScript Decorators in depth","description":"TypeScript is the superset of JavaScript. TypeScript Decorators are a feature in TypeScript through which you attach functionalities to various parts of objects and classes, functions, properties and parameters etc.TypeScript Decorators play an important role in many JavaScript based frameworks and technologies including Angular, React, VueJS and other prominent libraries which support TypeScript. That is why it is a very important part of every programmer's toolset.","image":"https://img-b.udemycdn.com/course/240x135/4778220_c957_3.jpg","price":1077.19,"discount":"30%"},
{"id":9,"course_name":"Understanding NPM - Node.js Package Manager","description":"In this course I will explain you what is NPM and how it is used.You will learn how to initialize new project, how to install new dependencies and explore their child dependencies.We will also discuss what is Semantic Versioning and what Major, Minor and Patch versions mean.You will also understand what is the purpose of the package-lock.json file.I will explain you what is the purpose of the NPM scripts and how they should be used. We will talk about built-in NPM scripts and custom script. Also we will combine several NPM scripts in a one using npm-run-all external package.You will understand what is executable script and what is the purpose of the .bin folder in the node_modules folder. I will explain you what is shebang line and how it is used on the Unix-based system and on Windows.","image":"https://img-b.udemycdn.com/course/240x135/1869566_f54d_5.jpg","price":3087.10,"discount":"40%"},
{"id":10,"course_name":"The JavaScript Bible - JavaScript Bootcamp","description":"This course covers everything you need to know about JavaScript and become either Frontend Web developer, or Full-stack Web Developer, or Backend developer.This course includes more than 70 CHALLENGES and all exercise files are available in Git repositories.We will start from the very beginning and you will learn fundamentals and basic concepts of JavaScript.Than you will learn new features included in ES6, ES7 etc.Also we will dive into the Node.js - environment for JavaScript code execution and you will understand what is the difference between Web Browser and Node.js.In separate sections we will discuss Babel, NPM, Webpack and MongoDB.Also you will learn most popular JavaScript framework - React.","image":"https://img-b.udemycdn.com/course/240x135/1586988_dcb2_15.jpg","price":1019.03,"discount":"50%"}
]